{
  "quests": [
    {
      "id": "party",
      "title": "Попперс-вечеринка в клубе SHHH",
      "steps": [
        {
          "id": "start",
          "text": "Ты стоишь у входа в здание, скрытое за вывеской 'Автосервис'. На часах почти полночь. Подсветка над дверью мигает фиолетовым. Стук сердца бьёт в ритме клубной музыки. Ты вдыхаешь — в воздухе уже витает лёгкий аромат попперса. \n\nПеред тобой — татуированный охранник, кивает: «Проходи. Только без страхов»...",
          "options": [
            { "label": "Войти в клуб", "next": "foyer" },
            { "label": "Сделать вдох глубже", "next": "inhale" }
          ]
        },
        {
          "id": "inhale",
          "text": "Ты задерживаешь дыхание, позволяя аромату проникнуть внутрь. Мир на секунду замирает. Свет становится мягче. Внутри тебя вспыхивает лёгкое возбуждение. Ты проходишь в клуб — уже немного пьяный от предвкушения.",
          "options": [
            { "label": "Идти в зал", "next": "foyer" }
          ]
        },
        {
          "id": "foyer",
          "text": "Фойе клуба встречает тебя шепотом и полумраком. На стенах проекционные тела, танцующие в бондаже. В центре — стойка с аксессуарами: маски, ошейники, флаконы попперса. Дева в латексе шепчет: «Выбери свой путь...»",
          "options": [
            { "label": "Выбрать маску и войти", "next": "dancefloor" },
            { "label": "Глубоко вдохнуть из флакона", "next": "trip" }
          ]
        },
        {
          "id": "trip",
          "text": "Попперс касается тебя — сладковато-жгучий. Ты чувствуешь, как внутри всё пульсирует. Тебя окутывает поток фиолетового света. Кто-то шепчет тебе в ухо: «Начнем...». Перед глазами появляются вспышки удовольствия.",
          "options": [
            { "label": "Следовать за голосом", "next": "backroom" },
            { "label": "Вернуться в реальность", "next": "dancefloor" }
          ]
        },
        {
          "id": "dancefloor",
          "text": "Ты входишь в основной зал. Мягкий дым, неон, медленные ритмы. Пары танцуют тесно, скользят руками по телам друг друга. На стене — табличка: «Найди того, кто ищет то же». \n\nТебя замечает персона в чёрной коже, с цепочкой в руке.",
          "options": [
            { "label": "Подойти ближе", "next": "contact" },
            { "label": "Уйти в VIP-зону", "next": "vip" }
          ]
        },
        {
          "id": "contact",
          "text": "Ты подходишь. Цепочка обвивает твоё запястье. Глаза напротив — игривые, властные. «Пульсируешь? — спрашивают. — Хочешь быть ведомым или ведущим?»",
          "options": [
            { "label": "Ведомым", "next": "sub" },
            { "label": "Ведущим", "next": "dom" }
          ]
        },
        {
          "id": "sub",
          "text": "Ты позволяешь себя вести. Руки за спиной. Ловкие пальцы затягивают манжеты. Лёгкий щелчок плётки по бедру. На фоне звучит: «Relax… deeper…». В этот момент ты — ощущение.",
          "product_id": "4VcsBKUtGH3r8b2APoP9",
          "options": []
        },
        {
          "id": "dom",
          "text": "Ты берёшь цепочку. Легко натягиваешь. Кто-то подчиняется, выгибаясь в наслаждении. Ты — в роли. В воздухе — аромат попперса и власти.",
          "product_id": "uGFHorJM0Pzv61c4sCvZ",
          "options": []
        },
        {
          "id": "vip",
          "text": "В VIP-зоне — полумрак и звук кожаных ремней. Кресло с подлокотниками. На нём — персона в ошейнике. «У тебя всего один вопрос: ты хочешь смотреть или участвовать?»",
          "options": [
            { "label": "Смотреть", "next": "watch" },
            { "label": "Участвовать", "next": "join" }
          ]
        },
        {
          "id": "watch",
          "text": "Ты садишься в угол. Перед тобой сцена страсти, завуалированная светом и звуком. В каждый стон ты вкладываешь своё воображение. Это твой кинотеатр удовольствий.",
          "product_id": "3MAoku8LflIxRfbvKziS",
          "options": []
        },
        {
          "id": "join",
          "text": "Ты входишь в круг. Тебе подают игрушку. Кто-то берёт тебя за талию. Мягкие ремни. Всё замирает. \n\nТы здесь, ты реальный, ты — часть игры.",
          "product_id": "bKZXJV31VbM2MSIR50xX",
          "options": []
        },
        {
          "id": "backroom",
          "text": "Ты идёшь за голосом. Комната за чёрной шторой. Внутри — матрасы, ароматы и дыхание. Попперс в воздухе разрывает тебя изнутри. Голос шепчет: «Пора узнать себя»…",
          "product_id": "7jbvhOXA16Cyn3RzSLjP",
          "options": []
        }
      ]
    },
    {
      "id": "mansion",
      "title": "Ночная тайна особняка",
      "steps": [
        {
          "id": "start",
          "text": "Ты стоишь перед массивной кованой дверью, покрытой временем и тайнами. Вокруг особняка — густой туман, будто завеса между реальностью и фантазией. Где-то вдалеке завывает ветер, и каждый его порыв будто шепчет тебе: \"Входи...\". Надпись на табличке: 'Вход только по желанию. Остальное — последствия'. Ты чувствуешь, как возбуждение медленно поднимается вдоль позвоночника. Пальцы тянутся к ручке, но в груди гулко бьётся сердце.\n\nТы на пороге другого мира. Готов ли ты ступить за грань?",
          "options": [
            {"label": "Открыть дверь и войти", "next": "hall"},
            {"label": "Осмотреться вокруг особняка", "next": "outside"}
          ]
        },
        {
          "id": "outside",
          "text": "Ты обходишь особняк. Сбоку находится окно с приоткрытой шторкой. Свет внутри мерцает, словно свечи танцуют на стенах. Под твоей ногой хрустит гравий, и на мгновение ты замираешь — в тишине слышны стоны. Неожиданно ты находишь чёрную записку: 'Ты наблюдаешь. Но хочешь ли ты участвовать?'",
          "options": [
            {"label": "Залезть через окно", "next": "maskroom"},
            {"label": "Вернуться к двери и войти как положено", "next": "hall"}
          ]
        },
        {
          "id": "hall",
          "text": "Холл окутан ароматом сандала и розового перца. Воздух — густой, пряный. Канделябры отбрасывают на стены тени, похожие на извивающиеся тела. На столике — бархатная маска и ключ с выгравированной надписью: 'Желание'. Записка: 'Надень. Найди путь. Не оборачивайся'. За маской тянется лёгкий след парфюма и страсти.\n\nТы понимаешь, что каждое твоё движение здесь уже запланировано... кем-то. Или чем-то.",
          "options": [
            {"label": "Надеть маску и следовать по коридору", "next": "corridor"},
            {"label": "Использовать ключ на боковой двери", "next": "library"}
          ]
        },
        {
          "id": "corridor",
          "text": "Коридор — как позвоночник дома: узкий, тёплый, бьющийся. Ты идёшь, ощущая ткань маски на лице и биение сердца в ушах. Из-за одной из дверей слышны шёпоты. Ты касаешься ручки — она горячая. Из другой двери доносится музыка, тихий электронный ритм и томный женский смех.\n\nКаждая дверь — соблазн, и выбор может изменить всё.",
          "options": [
            {"label": "Открыть дверь с шёпотом", "next": "shadows"},
            {"label": "Пойти на звук музыки", "next": "salon"}
          ]
        },
        {
          "id": "shadows",
          "text": "Ты заходишь в комнату, где свет преломляется сквозь красный тюль. На полу — маты, зеркала, игрушки. В углу — фигура в чёрном, дышащая медленно, вызывающе. Она протягивает руку, не произнося ни слова.\n\nТы ощущаешь, как твой пульс сливается с атмосферой. Пульсация между ног усиливается.\n\nТы готов отдаться. Или взять?",
          "options": [
            {"label": "Встать на колени и подчиниться", "next": "sub"},
            {"label": "Схватить руку и взять инициативу", "next": "dom"}
          ]
        },
        {
          "id": "sub",
          "text": "Ты опускаешься, принимая чужую волю. Металлические наручники мягко фиксируют руки. За спиной чувствуется дыхание, влажное, тёплое. Мягкая плеть касается тела, и с каждым вздохом ты теряешь контроль. В этот момент ты — воплощённое желание.\n\n",
          "product_id": "1MX6cRnh9dPpCjrG0IFA",
          "options": []
        },
        {
          "id": "dom",
          "text": "Ты берёшь руку, крепко. Повинуясь тебе, тело замирает. Ты ведёшь его к креслу, где уже ждёт комплект ремней. Ты — власть, они — марионетка. Ты медленно выбираешь первую игрушку.\n\n",
          "product_id": "IJXrc562ufeOfOtUlT1R",
          "options": []
        },
        {
          "id": "library",
          "text": "Ты открываешь массивную дверь. Комната — библиотека, но вместо книг на полках — фетиш-аксессуары и дискретные ящики с надписями: 'ИГРА', 'ПРЕДЕЛ', 'ИСТИНА'. На столе — блокнот с чужими фантазиями. Кто-то их исполнял.\n\nСквозь книжный шкаф виднеется тайный проход.",
          "options": [
            {"label": "Пройти через проход", "next": "secret_chamber"},
            {"label": "Открыть ящик 'ИГРА'", "next": "game"}
          ]
        },
        {
          "id": "game",
          "text": "Внутри — карточки с заданиями. 'Сними одну вещь с тела и пойди туда, где темнее'. 'Попроси наказания'. 'Подари оргазм не касаясь'.\n\nТы берёшь одну. И вдруг голос за спиной: 'Хочешь сыграть со мной?'",
          "product_id": "TkP5JG6JIutgB294AP79",
          "options": []
        },
        {
          "id": "secret_chamber",
          "text": "Ты проходишь в узкий проход. Комната освещена свечами. На стене — зеркало, в котором ты видишь себя… другим. Рядом — стол с арсеналом игрушек. Лежит записка: 'Последний выбор — всегда за тобой'.",
          "product_id": "0iHE7jh2SCh6CpahZgys",
          "options": []
        }
      ]
    },
    {
      "id": "delivery",
      "title": "Горячая доставка",
      "steps": [
        {
          "id": "start",
          "text": "Ты только успеваешь накинуть на себя что-то лёгкое, как звонок в дверь разрезает ленивый утренний воздух. Курьер? В это время? Ты подбегаешь, открываешь — и на пороге стоит он. Высокий, в форменной одежде, с коробкой, на которой жирно написано SHHH. Он не говорит ни слова, но его взгляд скользит по тебе, медленно и изучающе. Коробка... в ней что-то очень личное. Или провокационное?",
          "options": [
            {"label": "Принять коробку и закрыть дверь", "next": "alone"},
            {"label": "Пригласить его внутрь", "next": "invite"}
          ]
        },
        {
          "id": "alone",
          "text": "Ты берёшь коробку, киваешь и закрываешь дверь. Сердце колотится. Ты несёшь её в спальню. Там — вибратор, маска и карточка с надписью: \"Выбери, кем ты будешь сегодня — подчинённым или властным\". Всё внутри тебя начинает пульсировать от напряжения и предвкушения.",
          "options": [
            {"label": "Подчинённым", "next": "sub"},
            {"label": "Властным", "next": "dom"}
          ]
        },
        {
          "id": "invite",
          "text": "Он заходит, и атмосфера моментально густеет. Ты замечаешь, что его рука сжимает край коробки чуть крепче, чем нужно. Он опускает её на стол. — Вам доставку на особое удовольствие, — говорит он, слегка усмехнувшись. Его взгляд прожигает. Ты чувствуешь, как внутреннее напряжение нарастает. Он делает шаг ближе.\n\nКоробка распахивается сама. Внутри — игрушки, манжеты, масло и... карточка с твоим именем.",
          "options": [
            {"label": "Прочитать карточку вслух", "next": "read_card"},
            {"label": "Попросить его прочесть", "next": "let_him"}
          ]
        },
        {
          "id": "read_card",
          "text": "Ты берёшь карточку. \"Открой свои желания. Исследуй. Играй. Сегодня ты — хозяин своей похоти.\" Курьер улыбается и снимает куртку. Он говорит: — Тогда я — ваш помощник.\n\nТвоя кожа вспыхивает от прикосновений, которых ещё не было. Вся комната наполняется напряжением и воздухом, густым от феромонов.",
          "options": [
            {"label": "Схватить масло и начать", "next": "massage"},
            {"label": "Попросить его связать тебя", "next": "sub"}
          ]
        },
        {
          "id": "let_him",
          "text": "Он берёт карточку. Голос низкий, хриплый. — \"Сегодня ты узнаешь, каково это — не контролировать, а чувствовать.\" Ты сглатываешь. Его рука уже тянется к ремешку на твоём халате. Всё внутри сжимается от нетерпения.\n\nТы закрываешь глаза и слышишь, как застёжки щёлкают. Каждая — как звон удара плётки по чувствам.",
          "options": [
            {"label": "Взять контроль в свои руки", "next": "dom"},
            {"label": "Отдаться ему полностью", "next": "sub"}
          ]
        },
        {
          "id": "massage",
          "text": "Масло тёплое, с ароматом ванили и малины. Он ложится, обнажённый, готовый. Ты начинаешь массировать, чувствуя, как под твоими пальцами тело расслабляется, а возбуждение нарастает.\n\nТы — бог, ты творишь.",
          "product_id": "CEbUItmSUaabnpVhR9du",
          "options": []
        },
        {
          "id": "sub",
          "text": "Тебя мягко укладывают. Манжеты защёлкиваются с шелестом страсти. Он водит игрушкой по твоей коже, каждый раз останавливаясь на миллиметр от самой чувствительной точки. Ты извиваешься. Ты — его.\n\nОн шепчет: \"Ты даже не представляешь, как сильно я тебя хочу.\"\n\n",
          "product_id": "nC7cmhdGbzHZdPateiRE",
          "options": []
        },
        {
          "id": "dom",
          "text": "Ты кладёшь его на колени. Шёлковый шарф, что был в коробке, теперь у него на запястьях. Он смотрит на тебя снизу вверх, и в этих глазах — признание. Ты касаешься его тела, и каждый вздох — как команда.\n\nТы ведёшь. Он следует.\n\n",
          "product_id": "nL9x8hMLK04Y34Nj8MjU",
          "options": []
        }
      ]
    }
  ]
}